** DONE Aqara 清单确认
CLOSED: [2022-03-28 Mon 00:33] SCHEDULED: <2022-03-11 Fri 18:00>
:PROPERTIES:
:EXPORT_LATEX_CLASS_OPTIONS: [landscape]
:ARCHIVE_TIME: 2022-07-26 Tue 15:06
:ARCHIVE_FILE: ~/org/buy.org
:ARCHIVE_CATEGORY: buy
:ARCHIVE_TODO: DONE
:END:
| 名称                          | 类型        | 价格 | 服务费 | 合同个数 | 需要个数 | 合同费用 | 需要费用 | 链接       | 备注            |
|-------------------------------+-------------+------+--------+----------+----------+----------+----------+------------+-----------------|
| 新版 Aqara 双路模块           |             |  139 |   0.15 |        0 |        0 |       0. |       0. |            |                 |
| G3 摄像头（白色）(价格已修改) | 摄像头,网关 |  399 |   0.15 |        0 |        1 |       0. |   458.85 | [[aqara:d26]]  |                 |
| P100 霸王锁体                 | 门锁        |  348 |      0 |        0 |        0 |        0 |        0 |            |                 |
| 智能开关 T1（零火单键）       | 开关        |  259 |   0.15 |        0 |       10 |       0. |   2978.5 | [[aqara:d31]]  |                 |
| 全自动霸王导向片+门扣板       | 门锁        |    0 |      0 |        0 |        1 |        0 |        0 |            |                 |
| T1 无线开关（双键）           | 开关        |  149 |   0.15 |        0 |        0 |       0. |       0. |            |                 |
| 星空灰智能插座 H1（网关版）   | 网关        |  399 |   0.15 |        2 |        2 |    917.7 |    917.7 | [[aqara:smart-wall-outlet-h1-hub][h1-hub]]     |                 |
| M2 网关                       | 网关        |  399 |   0.15 |        1 |        1 |   458.85 |   458.85 | [[aqara:d1_2]] |                 |
| M1S 网关                      | 网关        |  249 |   0.15 |        2 |        2 |    572.7 |    572.7 | [[aqara:d29]]  |                 |
| HomePod mini 灰               | 网关        |  749 |   0.15 |        1 |        1 |   861.35 |   861.35 |            |                 |
| 小爱音响 Pro                  | 网关        |  299 |   0.15 |        1 |        1 |   343.85 |   343.85 |            |                 |
| 空调温控器 S2                 | 开关        |  269 |   0.15 |       10 |        0 |   3093.5 |       0. |            |                 |
| T1 无线开关                   | 开关        |  119 |   0.15 |        3 |        0 |   410.55 |       0. |            |                 |
| 智能开关 T1（零火三键）       | 开关        |  299 |   0.15 |       13 |       14 |  4470.05 |   4813.9 | [[aqara:d31]]  |                 |
| 智能开关 T1（零火双键）       | 开关        |  279 |   0.15 |       18 |       22 |   5775.3 |   7058.7 | [[aqara:d31]]  |                 |
| T1 人体传感器                 | 传感器      |  199 |   0.15 |        5 |        0 |  1144.25 |       0. | [[aqara:d17]]  | [[jd:100003525727]] |
| T1 温湿度传感器               | 传感器      |  149 |   0.15 |        1 |        0 |   171.35 |       0. |            |                 |
| 高精度人体传感器              | 传感器      |  299 |   0.15 |        1 |        0 |   343.85 |       0. |            |                 |
| 摄像机 G2H                    | 摄像头      |  399 |   0.15 |        1 |        0 |   458.85 |       0. |            |                 |
| 一折穹轨工艺费                |             |  100 |      0 |        2 |        2 |      200 |      200 |            |                 |
| 异形轨道包装运输费            |             |   50 |      0 |        1 |        1 |       50 |       50 |            |                 |
| 智能窗帘电机 C2+3 米直轨      | 窗帘        | 1199 |   0.15 |        9 |        9 | 12409.65 | 12409.65 |            |                 |
| H100 门锁                     | 门锁        | 2699 |   0.15 |        1 |        1 |  3103.85 |  3103.85 | [[aqara:smart-door-lock-h100][h100 lock]]  |                 |
| 合同优惠产品服务费增补        |             |  195 |      0 |        1 |        1 |      195 |      195 |            |                 |
| 摄像头服务费增补              |             |   60 |      0 |        0 |        1 |        0 |       60 |            |                 |
| 总价                          |             |      |        |          |          | 34980.65 |  34482.9 |            |                 |
#+TBLFM: $7=$3*(1+$4)*$5::@27$7=vsum(@I..@>>)
#+TBLFM: $8=$3*(1+$4)*$6::@27$8=vsum(@I..@>>)
** DONE 修复 GnuPG
CLOSED: [2023-05-22 Mon 19:10] SCHEDULED: <2023-05-22 Mon>
:PROPERTIES:
:ARCHIVE_TIME: 2023-07-28 Fri 16:01
:ARCHIVE_FILE: ~/org/inbox.org
:ARCHIVE_CATEGORY: inbox
:ARCHIVE_TODO: DONE
:END:
- State "DONE"       from "TODO"       [2023-05-22 Mon 19:10]
*downgrade* GnuPG from 2.4.1 -> 2.4.0 fixed the problem.

#+begin_src sh
brew info gnupg | grep "From:" | cut -d " " -f 2
#+end_src

#+RESULTS:
: https://mirrors.ustc.edu.cn/homebrew-core.git/Formula/gnupg.rb

#+begin_src sh
URL=https://raw.githubusercontent.com/Homebrew/homebrew-core/59edfe598541186430d49cc34f42671e849e2fc9/Formula/gnupg.rb
wget $URL
brew uninstall gnupg
brew install -s gnupg.rb
#+end_src

#+RESULTS:
| ==>   | Searching | for    | similarly | named | formulae | and | casks... |
| ==>   | Formulae  |        |           |       |          |     |          |
| gnupg |           |        |           |       |          |     |          |
|       |           |        |           |       |          |     |          |
| To    | install   | gnupg, | run:      |       |          |     |          |
| brew  | install   | gnupg  |           |       |          |     |          |
** DONE 完成 [[id:cce4cd49-fcbb-415b-b5eb-5faee6e89294][2021 上海行测 A类]]
SCHEDULED: <2021-11-03 Wed>
:PROPERTIES:
:Effort:   3:00
:ARCHIVE_TIME: 2021-12-06 Mon 13:57
:ARCHIVE_FILE: ~/org/study.org
:ARCHIVE_OLPATH: 公务员
:ARCHIVE_CATEGORY: study
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2021-11-05 Fri 16:56]--[2021-11-05 Fri 17:04] =>  0:08
CLOCK: [2021-11-05 Fri 16:48]--[2021-11-05 Fri 16:55] =>  0:07
CLOCK: [2021-11-05 Fri 16:20]--[2021-11-05 Fri 16:47] =>  0:27
CLOCK: [2021-11-05 Fri 15:59]--[2021-11-05 Fri 16:19] =>  0:20
CLOCK: [2021-11-05 Fri 09:28]--[2021-11-05 Fri 11:58] =>  2:30
CLOCK: [2021-11-04 Thu 11:25]--[2021-11-04 Thu 11:28] =>  0:03
CLOCK: [2021-11-03 Wed 16:04]--[2021-11-03 Wed 16:50] =>  0:46
CLOCK: [2021-11-03 Wed 13:17]--[2021-11-03 Wed 13:32] =>  0:15
:END:
** DONE 一键切换网络
SCHEDULED: <2023-09-19 Tue>
:PROPERTIES:
:ARCHIVE_TIME: 2023-09-22 Fri 22:39
:ARCHIVE_FILE: ~/org/work.org
:ARCHIVE_OLPATH: Inbox
:ARCHIVE_CATEGORY: work
:ARCHIVE_TODO: DONE
:END:
#+begin_src sh
  brew services stop xray
  networksetup -switchtolocation "Work"
  brew services start xray --file=/usr/local/etc/xray/work/homebrew.mxcl.xray.plist
#+end_src

#+RESULTS:
| Stopping | `xray`...    | (might  | take         | a       | while)              |         |                     |
| ==>      | Successfully | stopped | `xray`       | (label: | homebrew.mxcl.xray) |         |                     |
| found    | it!          | ==>     | Successfully | started | `xray`              | (label: | homebrew.mxcl.xray) |

#+begin_src sh
  brew services stop xray
  networksetup -switchtolocation "Automatic"
  brew services start xray --file=/usr/local/etc/xray/basic/homebrew.mxcl.xray.plist
#+end_src

#+RESULTS:
| Stopping | `xray`...    | (might  | take         | a       | while)              |         |                     |
| ==>      | Successfully | stopped | `xray`       | (label: | homebrew.mxcl.xray) |         |                     |
| found    | it!          | ==>     | Successfully | started | `xray`              | (label: | homebrew.mxcl.xray) |

[[file:~/Library/Mobile Documents/com~apple~CloudDocs/Documents/Raycast/network-work.sh::@raycast.title Network Work]]
** DONE 使用 chezmoi 设置 rime
SCHEDULED: <2024-04-27 Sat>
:PROPERTIES:
:Effort:   30
:ARCHIVE_TIME: 2024-07-16 Tue 14:27
:ARCHIVE_FILE: ~/org/emacs.org
:ARCHIVE_OLPATH: Inbox
:ARCHIVE_CATEGORY: emacs
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2024-04-27 Sat 15:36]--[2024-04-27 Sat 16:39] =>  1:03
:END:

